Конфигурация отчетов/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
				<xr:Item>AccumulationRegister.ОборотПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолжностиПоПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипРассчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДневнойОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСоздан</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОрдер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция  НайтиОплатуНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную КАК СсылкаНаНакладную,
		|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	
КонецФункции

&НаКлиенте
Процедура НайтиОплату(Команда)
	СсылкаНаОрдер = НайтиОплатуНаСервере();
	Если СсылкаНаОрдер = Неопределено Тогда
		Сообщить("Оплата не была найдена!");
	Иначе
		Парам = Новый Структура;
		Парам.Вставить("Ключ",СсылкаНаОрдер);
		ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента",Парам);
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДокументСоздан = ПодготовкаДанных.ПолучениеПользователя();    
КонецПроцедуры       

&НаСервере
Процедура СписокТоваров_ПриИзминении_НаСервере(ИмяКолонки, ТекущаяСтрока)
		
	Если ИмяКолонки = "СписокТоваровНоменклатура" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
	    ДанныеСтроки.СтараяЦена = Справочники.Номенклатура.ПолучитьЦенуТовара(ДанныеСтроки.Номенклатура); 
		//Модуль_Учета.ПолучитьЦенуНоменлатуры(ДанныеСтроки.Номенклатура);   
		ДанныеСтроки.ПроцентНаценки = Справочники.Номенклатура.ПолучитьПроцентНаценки(ДанныеСтроки.Номенклатура);
	КонецЕсли;      
	
	Если ИмяКолонки = "СписокТоваровКоличество" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
	КонецЕсли;

	Если ИмяКолонки = "СписокТоваровЦена" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
	
	КонецЕсли;
	
	Если ИмяКолонки = "СписокТоваровСумма" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		
 
	КонецЕсли;
	
	Если ИмяКолонки = "СписокТоваровПроцентНаценки" Тогда
		ДанныеСтроки = Объект.СписокТоваров.Получить(ТекущаяСтрока);		

	КонецЕсли;

КонецПроцедуры // СписокТоваров_ПриИзминении_НаСервере()


&НаКлиенте
Процедура СписокТоваровПриИзменении(Элемент)
	
	СписокТоваров_ПриИзминении_НаСервере(Элемент.Имя, Элементы.СписокТоваров.ТекущиеДанные.ИсходныйНомерСтроки);   
	
КонецПроцедуры
